stratus9/APRS_STM8_tracker/v2/main.c
/**
  ******************************************************************************
  * @file    Project/main.c 
  * @author  MCD Application Team
  * @version V2.2.0
  * @date    30-September-2014
  * @brief   Main program body
   ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; COPYRIGHT 2014 STMicroelectronics</center></h2>
  *
  * Licensed under MCD-ST Liberty SW License Agreement V2, (the "License");
  * You may not use this file except in compliance with the License.
  * You may obtain a copy of the License at:
  *
  *        http://www.st.com/software_license_agreement_liberty_v2
  *
  * Unless required by applicable law or agreed to in writing, software 
  * distributed under the License is distributed on an "AS IS" BASIS, 
  * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
  * See the License for the specific language governing permissions and
  * limitations under the License.
  *
  ******************************************************************************
  */ 


/* Includes ------------------------------------------------------------------*/
#include "stm8s.h"
#include "main.h"

/* Private defines -----------------------------------------------------------*/
#define AX25_FLAG 0x7E
#define CRC_POLY 0x8408
#define APRS_DEST_CALLSIGN				"ROCKET" // APExxx = Pecan device
#define APRS_DEST_SSID                                  0
#define APRS_OWN_CALLSIGN				"BARTEK"
ax25_t APRS_frame;

#define RADIO_CLK	30000000UL

uint32_t outdiv;
uint8_t initialized = 0;


/* Private functions ---------------------------------------------------------*/


void main(void)
{
  /* Select fCPU = 16MHz */
  CLK_SYSCLKConfig(CLK_PRESCALER_HSIDIV1);      //118 B
  
  /* Init UART */
  USART_Initialization();       //1182 B -> 85 B
  
  /* Init SPI */
  SPI_Initialization();         //334 B -> 78 B
  
  GPIO_Initialization();        //263 B -> 57 B
   
  Delay(10000);
  Timer1_Init();                //716 B
  Timer2_Init();                //516 B
  enableInterrupts();
  
  //inicjalizacja radia
  initAFSK();                   //2984 B
  Timer1_2200Hz();
  
  
  while(0){
    //Timer1_2200Hz();
    Delay(1000000);
    //Timer1_1200Hz();
    Delay(1000000);
  }
  
  
  
  /* Infinite loop */
  
  
  // nie dziala dalej z ! aprs_encode_message(&APRS_frame, "BARTEK", 11, "WIDE2-1", 11, "!0123.22N/14345.33SO/A=123456/P3S4T12V12V");
  aprs_encode_message(&APRS_frame, "BARTEK", 11, "WIDE2-1", 11, ";Carbonara*141923/3859.11N/07629.23WO165/027/A=001234/Clb=5.0m/s State=Boost Status=OK");
  //aprs_encode_message(&APRS_frame, "BARTEK", 11, "WIDE2-1", 11, "@141923/3859.11N/07629.23WO165/027/A=001234/comments");
  //aprs_encode_message(&APRS_frame, "BARTEK", 11, "WIDE2-1", 11, "@141923/5225.85N/01654.50E#PHG4480 SPn,W5 Poznan Digi");
  while (1){
    //do we have any data to transmit?
    if (APRS_frame.point <= APRS_frame.size) {
      //Si4463_TX(); // enter transmit mode 
      TIM1_Cmd(ENABLE);
      // wait until everything has been sent
      while (!(APRS_frame.end)) {}
      TIM1_Cmd(DISABLE);
      Delay(500000);
      APRS_frame.point = 0;
      APRS_frame.end = 0;

    }
    
  }
}

/**
  * @brief  Delay.
  * @param  nCount
  * @retval None
  */
void Delay(uint32_t nCount)
{
    /* Decrement nCount value */
    while (nCount != 0)
    {
        nCount--;
    }
}

//======================================================================================
//                              GPIO
//======================================================================================

void GPIO_Initialization(void){
  /*
  GPIO_Init(GPIOD, (GPIO_Pin_TypeDef)GPIO_PIN_2, GPIO_MODE_OUT_PP_HIGH_FAST);   //Si4463 CS   //13 B
  GPIO_WriteHigh (GPIOD, GPIO_PIN_2);         //9 B
  
  GPIO_Init(GPIOC, (GPIO_Pin_TypeDef)GPIO_PIN_3, GPIO_MODE_OUT_PP_HIGH_FAST);   //13 B
  
  GPIO_Init(GPIOD, (GPIO_Pin_TypeDef)GPIO_PIN_4, GPIO_MODE_OUT_PP_HIGH_FAST);   //13 B
  GPIO_WriteHigh (GPIOD, GPIO_PIN_4);           //9 B
  */
  GPIO_Init_Fast();   //57 B
}

void GPIO_Init_Fast(){
  //PD2 - SI4463 CS pin
  GPIOD->CR2 &= ~0x04;  //slow slope 2MHz
  GPIOD->ODR |= 0x04;   //Init High state
  GPIOD->DDR |= 0x04;   //Output
  GPIOD->CR1 |= 0x04;   //Push-Pull
  GPIOD->ODR |= 0x04;   //Init High state
  
  //PC3 - ??
  GPIOC->CR2 &= ~0x08;  //slow slope 2MHz
  GPIOC->DDR |= 0x08;   //Output
  GPIOC->CR1 |= 0x08;   //Push-Pull
  
  //PD4 - ??
  GPIOD->CR2 &= ~0x10;  //slow slope 2MHz
  GPIOD->ODR |= 0x10;   //Init High state
  GPIOD->DDR |= 0x10;   //Output
  GPIOD->CR1 |= 0x10;   //Push-Pull
  GPIOD->ODR |= 0x10;   //Init High state
}

//=======================================================================================
//                              UART
//=======================================================================================
void USART_Initialization(void){
  UART1_DeInit_Fast();     //47 B
  
  //UART1_Init((uint32_t)115200, UART1_WORDLENGTH_8D, UART1_STOPBITS_1, UART1_PARITY_NO, UART1_SYNCMODE_CLOCK_DISABLE, UART1_MODE_TXRX_ENABLE); //1163 B
  UART1_Init_Fast();    //29 B
  UART1_ENABLE();       //19 B -> 9 B
}

void UART1_Init_Fast(){
  #define UART1_baud 115200
  #define UART1_BBR1 0x08
  #define UART1_BBR2 0x0B

  UART1->CR1 = 0x00;           //set 8-bit word length, no parity, UART enabled (change for low power)
  UART1->CR3 = 0x00;           //set 1 bit Stop

  UART1->BRR1 = UART1_BBR1; 
  UART1->BRR2 = UART1_BBR2;       
   
  UART1->CR2 |= 0x08 | 0x04;    //RX i TX enabled
}

void UART1_DeInit_Fast(){
  /* Clear the Idle Line Detected bit in the status register by a read
  to the UART1_SR register followed by a Read to the UART1_DR register */
  
  (void)UART1->SR;    //3B
  (void)UART1->DR;    //3B
  
  UART1->BRR2 = 0x00;  // Set UART1_BRR2 to reset value 0x00    //4B
  UART1->BRR1 = 0x00;  // Set UART1_BRR1 to reset value 0x00    //4B
  
  UART1->CR1 = 0x00;  // Set UART1_CR1 to reset value 0x00    //4B
  UART1->CR2 = 0x00;  // Set UART1_CR2 to reset value 0x00    //4B
  UART1->CR3 = 0x00;  // Set UART1_CR3 to reset value 0x00    //4B
  UART1->CR4 = 0x00;  // Set UART1_CR4 to reset value 0x00    //4B
  UART1->CR5 = 0x00;  // Set UART1_CR5 to reset value 0x00    //4B
  
