stratus9/APRS_STM8_tracker/v2/main.c
  UART1->GTR = 0x00;    //4B
  UART1->PSCR = 0x00;   //4B
}

void UART1_ENABLE(){
    /* UART1 Enable */
    UART1->CR1 &= (~0x20); 
}

void USART_SendString(char * value){
  while(*value){
    while (UART1_GetFlagStatus(UART1_FLAG_TXE) == RESET){}
    UART1_SendData8(*value++);
  }
}

void USART_SendChar(char value){
  while (UART1_GetFlagStatus(UART1_FLAG_TXE) == RESET){}
  UART1_SendData8(value);
}

//=======================================================================================
//                              SPI
//=======================================================================================
void SPI_Initialization(void){
  SPI_DeInit();       //25 B
  /* Initialize SPI in Slave mode  */
  //SPI_Init(SPI_FIRSTBIT_MSB, SPI_BAUDRATEPRESCALER_64, SPI_MODE_MASTER, SPI_CLOCKPOLARITY_LOW, SPI_CLOCKPHASE_1EDGE, SPI_DATADIRECTION_2LINES_FULLDUPLEX, SPI_NSS_SOFT, (uint8_t)0x07);       //305 B
  SPI_Init_Fast();    //8 B
  /* SPI Enable */
  SPI_Cmd(ENABLE);    //29 B
}
//void SPI_Init(SPI_FirstBit_TypeDef FirstBit, SPI_BaudRatePrescaler_TypeDef BaudRatePrescaler, SPI_Mode_TypeDef Mode, SPI_ClockPolarity_TypeDef ClockPolarity, SPI_ClockPhase_TypeDef ClockPhase, SPI_DataDirection_TypeDef Data_Direction, SPI_NSS_TypeDef Slave_Management, uint8_t CRCPolynomial)

void SPI_Init_Fast(){
  SPI->CR1 = 0x28 | 0x04;      //MSB first, x64 prescaler, polarity Low, Master
  SPI->CR2 = 0x02 | 0x01;      //Full duplex, Software slave management enabled, Master
}

void SPI_wait(void){
  while (SPI_GetFlagStatus(SPI_FLAG_TXE)== RESET){}
}

void SPI_sendByte(uint8_t value){
  SPI_wait();
  SPI_SendData(value);
}

uint8_t SPI_ReadByte(void){
  uint8_t Data = 0;

  /* Wait until the transmit buffer is empty */
  while (SPI_GetFlagStatus(SPI_FLAG_TXE) == RESET);
  /* Send the byte */
  SPI_SendData(0x00);

  /* Wait until a data is received */
  while (SPI_GetFlagStatus(SPI_FLAG_BSY)== SET);
  while (SPI_GetFlagStatus(SPI_FLAG_RXNE) == RESET);
  /* Get the received data */
  Data = SPI_ReceiveData();

  /* Return the shifted data */
  return Data;
}

uint8_t SPI_RWByte(uint8_t value){
  uint8_t Data = 0;

  /* Wait until the transmit buffer is empty */
  while (SPI_GetFlagStatus(SPI_FLAG_TXE)== RESET){}
  /* Send the byte */
  SPI_SendData(value);
  while (SPI_GetFlagStatus(SPI_FLAG_RXNE) == RESET);
  Data = SPI_ReceiveData();
  
  SPI_ClearRXBuffer();
  /* Return the shifted data */
  return Data;
}

void SPI_ClearRXBuffer(){
  while (SPI_GetFlagStatus(SPI_FLAG_RXNE) == SET){
    SPI_ReceiveData();
  }
}

//========================================================================================
//                      SI4463
//========================================================================================

void Si4463_CS(uint8_t value){
  SPI_wait();
  Delay(100);           //problem z CS!!
  if(value) GPIO_WriteLow(GPIOD, GPIO_PIN_2);
  else GPIO_WriteHigh(GPIOD, GPIO_PIN_2);
}

void Si4463_ON(){
  GPIO_WriteLow (GPIOD, GPIO_PIN_4);
}

void Si4463_OFF(){
  GPIO_WriteHigh (GPIOD, GPIO_PIN_4);
}

void _si_trx_cs_enable(){
  Si4463_CS(1);
}

void _si_trx_cs_disable(){
  Si4463_CS(0);
}

uint8_t spi_bitbang_transfer(uint8_t tmp){
  uint8_t wynik = SPI_RWByte(tmp);
  return wynik;
}

void _si_trx_transfer_nocts(int tx_count, int rx_count, uint8_t *data){
  /* Unused */
  (void)rx_count;

  /* Send command */
  Si4463_CS(1);

  for (int i = 0; i < tx_count; i++) {
    SPI_RWByte(data[i]);
  }

  Si4463_CS(0);
}

void _si_trx_transfer(int tx_count, int rx_count, uint8_t *data){
  uint8_t response;

  /* Send command */
  _si_trx_cs_enable();

  for (int i = 0; i < tx_count; i++) {
    spi_bitbang_transfer(data[i]);
  }

  _si_trx_cs_disable();

  /**
   * Poll CTS. From the docs:
   *
   * READ_CMD_BUFF is used to poll the CTS signal via the SPI bus. The
   * NSEL line should be pulled low, followed by sending the
   * READ_CMD_BUFF command on SDI. While NSEL remains asserted low, an
   * additional eight clock pulses are sent on SCLK and the CTS
   * response byte is read on SDO. If the CTS response byte is not
   * 0xFF, the host MCU should pull NSEL high and repeat the polling
   * procedure.
   */

  do {
    for (int i = 0; i < 200; i++); /* Approx. 20µS */
    _si_trx_cs_enable();

    /* Issue READ_CMD_BUFF */
    spi_bitbang_transfer(SI_CMD_READ_CMD_BUFF);
    response = spi_bitbang_transfer(0xFF);

    /* If the reply is 0xFF, read the response */
    if (response == 0xFF) break;

    /* Otherwise repeat the procedure */
    _si_trx_cs_disable();

  } while (1); /* TODO: Timeout? */

  /**
   * Read response. From the docs:
   *
   * If the CTS response byte is 0xFF, the host MCU should keep NSEL
   * asserted low and provide additional clock cycles on SCLK to read
   * out as many response bytes (on SDO) as necessary. The host MCU
   * should pull NSEL high upon completion of reading the response
   * stream.
   */
  for (int i = 0; i < rx_count; i++) {
    data[i] = spi_bitbang_transfer(0xFF);
  }

  _si_trx_cs_disable();
}

void Si4464_write(uint8_t *data, int tx_count){
  _si_trx_transfer(tx_count, 0, data);
}

void Si4464_read(uint8_t *data, int tx_count){
  _si_trx_transfer(tx_count, 0, data);
}

void initAFSK() {
  // Initialize radio and tune
  Si4464_Init();
  setModemAFSK();
  radioTune(433000000, 0, 1, 0);
  
}

void Si4464_Init(void) {
	// Reset radio)
	radioShutdown();
	Delay(100000);  //>10ms

	// Power up transmitter
	radioTurnOn();	                        // Radio SDN low (power up transmitter)
	Delay(100000);		                // Wait for transmitter to power up
        
        /* Poll for part number */
        while (si_trx_get_part_info() != 17507);

	// Power up (transmits oscillator type)
	uint8_t x3 = (RADIO_CLK >> 24) & 0x0FF;
	uint8_t x2 = (RADIO_CLK >> 16) & 0x0FF;
	uint8_t x1 = (RADIO_CLK >>  8) & 0x0FF;
	uint8_t x0 = (RADIO_CLK >>  0) & 0x0FF;
	uint8_t init_command[] = {0x02, 0x01, 0x01, x3, x2, x1, x0};
	Si4464_write(init_command, 7);
	Delay(200000);

	// Set transmitter GPIOs
	uint8_t gpio_pin_cfg_command[] = {
		0x13,	// Command type = GPIO settings
		0x00,	// GPIO0        0 - PULL_CTL[1bit] - GPIO_MODE[6bit]
		0x04,	// GPIO1        0 - PULL_CTL[1bit] - GPIO_MODE[6bit]
		0x03,	// GPIO2        0 - PULL_CTL[1bit] - GPIO_MODE[6bit]
		0x02,	// GPIO3        0 - PULL_CTL[1bit] - GPIO_MODE[6bit]
		0x00,	// NIRQ
		0x00,	// SDO
		0x00	// GEN_CONFIG
	};
	Si4464_write(gpio_pin_cfg_command, 8);
	Delay(200000);

	initialized = 1;
}

uint16_t si_trx_get_part_info(void){
  uint8_t buffer[3];

  buffer[0] = SI_CMD_PART_INFO;

