stratus9/APRS_STM8_tracker/v2/main.c
  _si_trx_transfer(1, 3, buffer);

  return (buffer[1] << 8) | buffer[2];
}

void setFrequency(uint32_t freq, uint16_t shift){
  // Set the output divider according to recommended ranges given in Si4464 datasheet
  uint32_t band = 0;
  if(freq < 705000000UL) {outdiv = 6;  band = 1;};
  if(freq < 525000000UL) {outdiv = 8;  band = 2;};
  if(freq < 353000000UL) {outdiv = 12; band = 3;};
  if(freq < 239000000UL) {outdiv = 16; band = 4;};
  if(freq < 177000000UL) {outdiv = 24; band = 5;};

  // Set the band parameter
  uint32_t sy_sel = 8;
  uint8_t set_band_property_command[] = {0x11, 0x20, 0x01, 0x51, (band + sy_sel)};
  Si4464_write(set_band_property_command, 5);
        
  // Set the PLL parameters
  uint32_t f_pfd = 2 * RADIO_CLK / outdiv;
  uint32_t n = ((uint32_t)(freq / f_pfd)) - 1;
  float ratio = (float)freq/ (float)f_pfd;
  float rest  = ratio - (float)n;

  uint32_t m = (uint32_t)(rest * 524288UL);
  uint32_t m2 = m >> 16;
  uint32_t m1 = (m - m2 * 0x10000) >> 8;
  uint32_t m0 = (m - m2 * 0x10000 - (m1 << 8));
  
  uint32_t channel_increment = 524288 * outdiv * shift / (2 * RADIO_CLK);
  uint8_t c1 = channel_increment / 0x100;
  uint8_t c0 = channel_increment - (0x100 * c1);
  
  uint8_t set_frequency_property_command[] = {0x11, 0x40, 0x04, 0x00, n, m2, m1, m0, c1, c0};
  Si4464_write(set_frequency_property_command, 10);
  
  uint32_t x = ((524288.0 * outdiv * 1300.0)/((2*RADIO_CLK))*2.0);
  uint8_t x2 = (x >> 16) & 0xFF;
  uint8_t x1 = (x >>  8) & 0xFF;
  uint8_t x0 = (x >>  0) & 0xFF;
  uint8_t set_deviation[] = {0x11, 0x20, 0x03, 0x0a, x2, x1, x0};
  Si4464_write(set_deviation, 7);
}

void setShift(uint16_t shift) {
	if(!shift)
		return;

	float units_per_hz = (( 0x40000 * outdiv ) / (float)RADIO_CLK);

	// Set deviation for 2FSK
	uint32_t modem_freq_dev = (uint32_t)(units_per_hz * shift / 2.0 );
	uint8_t modem_freq_dev_0 = 0xFF & modem_freq_dev;
	uint8_t modem_freq_dev_1 = 0xFF & (modem_freq_dev >> 8);
	uint8_t modem_freq_dev_2 = 0xFF & (modem_freq_dev >> 16);

	uint8_t set_modem_freq_dev_command[] = {0x11, 0x20, 0x03, 0x0A, modem_freq_dev_2, modem_freq_dev_1, modem_freq_dev_0};
	Si4464_write(set_modem_freq_dev_command, 7);
}

void setModemAFSK(void) {
	// Disable preamble
	uint8_t disable_preamble[] = {0x11, 0x10, 0x01, 0x00, 0x00};
	Si4464_write(disable_preamble, 5);

	// Do not transmit sync word
	uint8_t no_sync_word[] = {0x11, 0x11, 0x01, 0x00, (0x01 << 7)};
	Si4464_write(no_sync_word, 5);

	// Setup the NCO modulo and oversampling mode
	uint32_t s = RADIO_CLK / 10;
	uint8_t f3 = (s >> 24) & 0xFF;
	uint8_t f2 = (s >> 16) & 0xFF;
	uint8_t f1 = (s >>  8) & 0xFF;
	uint8_t f0 = (s >>  0) & 0xFF;
	uint8_t setup_oversampling[] = {0x11, 0x20, 0x04, 0x06, f3, f2, f1, f0};
	Si4464_write(setup_oversampling, 8);

	// Setup the NCO data rate for APRS
        uint32_t speed = 4400;
	//uint8_t setup_data_rate[] = {0x11, 0x20, 0x03, 0x03, (uint8_t)(speed >> 16), (uint8_t)(speed >> 8), (uint8_t)speed};
	uint8_t setup_data_rate[] = {0x11, 0x20, 0x03, 0x03, 0x00, 0x11, 0};
        Si4464_write(setup_data_rate, 7);

	// Use 2GFSK from async GPIO1
	uint8_t use_2gfsk[] = {0x11, 0x20, 0x01, 0x00, 0x2B};   //2B
	Si4464_write(use_2gfsk, 5);

	// Set AFSK filter
	uint8_t coeff[] = {0x01,0x03,0x08,0x11,0x21,0x36,0x4D,0x60,0x67};
	uint8_t i;
	for(i=0; i<sizeof(coeff); i++) {
		uint8_t msg[] = {0x11, 0x20, 0x01, 0x17-i, coeff[i]};
		Si4464_write(msg, 5);
	}
}

void setModemOOK(void) {
	// Use OOK from async GPIO1
	uint8_t use_ook[] = {0x11, 0x20, 0x01, 0x00, 0xA9};
	Si4464_write(use_ook, 5);
}

void setModem2FSK(void) {
	// use 2FSK from async GPIO1
	uint8_t use_2fsk[] = {0x11, 0x20, 0x01, 0x00, 0xAA};
	Si4464_write(use_2fsk, 5);
}

void setModem2GFSK(uint32_t speed) {
	// Disable preamble
	uint8_t disable_preamble[] = {0x11, 0x10, 0x01, 0x00, 0x00};
	Si4464_write(disable_preamble, 5);

	// Do not transmit sync word
	uint8_t no_sync_word[] = {0x11, 0x11, 0x01, 0x00, (0x01 << 7)};
	Si4464_write(no_sync_word, 5);

	// Setup the NCO modulo and oversampling mode
	uint32_t s = RADIO_CLK / 10;
	uint8_t f3 = (s >> 24) & 0xFF;
	uint8_t f2 = (s >> 16) & 0xFF;
	uint8_t f1 = (s >>  8) & 0xFF;
	uint8_t f0 = (s >>  0) & 0xFF;
	uint8_t setup_oversampling[] = {0x11, 0x20, 0x04, 0x06, f3, f2, f1, f0};
	Si4464_write(setup_oversampling, 8);

	// Setup the NCO data rate for 2GFSK
	uint8_t setup_data_rate[] = {0x11, 0x20, 0x03, 0x03, (uint8_t)(speed >> 16), (uint8_t)(speed >> 8), (uint8_t)speed};
	Si4464_write(setup_data_rate, 7);

	// Use 2GFSK from async GPIO1
	uint8_t use_2gfsk[] = {0x11, 0x20, 0x01, 0x00, 0x2B};
	Si4464_write(use_2gfsk, 5);
}

void setPowerLevel(int8_t level) {
	// Set the Power
	uint8_t set_pa_pwr_lvl_property_command[] = {0x11, 0x22, 0x01, 0x01, dBm2powerLvl(level)};
	Si4464_write(set_pa_pwr_lvl_property_command, 5);
}

void startTx(uint16_t size) {
	uint8_t change_state_command[] = {0x31, 0x00, 0x30, (size >> 8) & 0x1F, size & 0xFF};
	Si4464_write(change_state_command, 5);
}

void stopTx(void) {
	uint8_t change_state_command[] = {0x34, 0x03};
	Si4464_write(change_state_command, 2);
}

uint8_t dBm2powerLvl(int32_t dBm) {
	if(dBm < -35) {
		return 0;
	} else if(dBm < -7) {
		return (uint8_t)((2*dBm+74)/15);
	} else if(dBm < 2) {
		return (uint8_t)((2*dBm+26)/3);
	} else if(dBm < 8) {
		return (uint8_t)((5*dBm+20)/3);
	} else if(dBm < 13) {
		return (uint8_t)(3*dBm-4);
	} else if(dBm < 18) {
		return (uint8_t)((92*dBm-1021)/5);
	} else {
		return 127;
	}
}

void radioShutdown(void) {
	GPIO_WriteHigh (GPIOD, GPIO_PIN_4);
	initialized = 0;
}

void radioTurnOn(void) {
	GPIO_WriteLow (GPIOD, GPIO_PIN_4);
}

/**
 * Tunes the radio and activates transmission.
 * @param frequency Transmission frequency in Hz
 * @param shift Shift of FSK in Hz
 * @param level Transmission power level in dBm
 */
uint8_t radioTune(uint32_t frequency, uint16_t shift, int8_t level, uint16_t size) {
	if(!inRadioBand(frequency)) return 0;

	setFrequency(frequency, shift);	// Set frequency
	setShift(shift);		// Set shift
	setPowerLevel(level);		// Set power level

	startTx(size);
	return 1;
}

int8_t Si4464_getTemperature(void) {
  /*
	uint8_t txData[2] = {0x14, 0x10};
	uint8_t rxData[8];
	Si4464_read(txData, 2, rxData, 8);
	uint16_t adc = rxData[7] | ((rxData[6] & 0x7) << 8);
	return (899*adc)/4096 - 293;
  */
  return 0;
}


//===============================================================================================
//                              APRS
//===============================================================================================

void ax25_init(ax25_t *packet){
  packet->max_size = 500;
  packet->size = 0;
  packet->point = 0;
}

void ax25_add_header(ax25_t *packet, uint8_t *callsign, uint8_t ssid, uint8_t *path, uint16_t preamble){
  uint8_t i, j;
  uint8_t tmp[8];
  packet->size = 0;

  // Send preamble ("a bunch of 0s")
  for(i=0; i<preamble; i++) ax25_add_sync(packet);

  // Send flag
  for(uint8_t i=0; i<preamble; i++) ax25_add_flag(packet);
  //ax25_add_flag(packet);

