stratus9/APRS_STM8_tracker/v2/main.c
  ax25_add_path(packet, APRS_DEST_CALLSIGN, APRS_DEST_SSID, 0);	// Destination callsign
  ax25_add_path(packet, callsign, ssid, path[0] == 0 || path == 0);	// Source callsign

  // Parse path
  for(i=0, j=0; (path[i-1] != 0 || i == 0) && path != 0; i++) {
    if(path[i] == ',' || path[i] == 0) { // Found block in path
      if(!j) // Block empty
              break;

      // Filter Path until '-'
      tmp[j] = 0;
      uint8_t p[8];
      uint8_t t;
      for(t=0; t<j && tmp[t] != '-'; t++)
              p[t] = tmp[t];
      p[t] = 0;

      // Filter TTL
      uint8_t s = ((tmp[t] == '-' ? tmp[++t] : tmp[--t])-48) & 0x7;

      if(s != 0)
              ax25_add_path(packet, p, s, path[i] == 0);
      j = 0;

    } else {
      tmp[j++] = path[i];
    }
  }

  // Control field: 3 = APRS-UI frame
  ax25_add_byte(packet, 0x03);

  // Protocol ID: 0xf0 = no layer 3 data
  ax25_add_byte(packet, 0xf0);
}

void ax25_add_footer(ax25_t *packet){
  // Save the crc so that it can be treated it atomically
  uint16_t final_crc = ax25_CRC(packet);

  // Send CRC
  ax25_add_byte(packet, (final_crc & 0xff));
  final_crc >>= 8;
  ax25_add_byte(packet, (final_crc & 0xff));

  // Signal the end of frame
  ax25_add_flag(packet);
}

uint16_t ax25_CRC(ax25_t *packet){              //
  
  uint8_t i = 0;
  uint8_t j;
  uint16_t crc_reg = 0xFFFF;
  uint8_t data_tmp;

  // No data so return zeros 
  if (packet->size == 0)
      return (~crc_reg);
  
  //find preamble end
  while(packet->data[i] != 0xA4){
    i++;
    if(i > 100) return 0;
  }
  
  // Loop through each byte 
  for (; i < packet->size; i++) {
    data_tmp = packet->data[i];
    // Loop through each bit 
    for (j=0; j < 8; j++, data_tmp >>= 1) {
      if ((crc_reg & 0x0001) ^ (data_tmp & 0x0001)) 
            crc_reg = (crc_reg >> 1) ^ CRC_POLY;
       else  crc_reg >>= 1;
    }
  }

  // Return 1's complement
  packet->crc = (~crc_reg);
  return (~crc_reg);
  //return 0xffff;
}

void ax25_add_sync(ax25_t *packet){
  if(packet->size >= packet->max_size) return; // Prevent buffer overrun
  packet->data[packet->size++] = 0x00;
}

void ax25_add_flag(ax25_t *packet){
  if(packet->size >= packet->max_size) return; // Prevent buffer overrun
  packet->data[packet->size++] = AX25_FLAG;
}

void ax25_add_string(ax25_t *packet, uint8_t *string){
  int i;
  for(i=0; string[i]; i++) {
    ax25_add_byte(packet, string[i]);
  }
}

void ax25_add_path(ax25_t *packet, uint8_t *callsign, uint8_t ssid, uint8_t last){
  uint8_t j;

  // Transmit callsign
  for(j = 0; callsign[j]; j++) ax25_add_byte(packet, callsign[j] << 1);

  // Transmit pad
  for( ; j < 6; j++) ax25_add_byte(packet, ' ' << 1);

  // Transmit SSID. Termination signaled with last bit = 1
  ax25_add_byte(packet, ('0' + ssid) << 1 | (last & 0x1));
}

void ax25_add_byte(ax25_t *packet, uint8_t byte){
  if(packet->size >= packet->max_size) return; // Prevent buffer overrun
  packet->data[packet->size++] = byte;
}

uint32_t aprs_encode_message(ax25_t* buffer, uint8_t * callsign, uint8_t ssid, uint8_t * path, uint16_t preamble, uint8_t *text){
  ax25_init(buffer);

  // Encode APRS header
  ax25_add_header(buffer, callsign, ssid, path, preamble);
  
  // Encode message
  ax25_add_string(buffer, text);

  // Send footer
  ax25_add_footer(buffer);

  return buffer->size;
}


//==========================================================================================================
//                              Timer
//==========================================================================================================

void Timer1_Init(){
  TIM1_DeInit();
  /* Time Base configuration */
  /*
  TIM1_Period = 4095
  TIM1_Prescaler = 0
  TIM1_CounterMode = TIM1_COUNTERMODE_UP
  TIM1_RepetitionCounter = 0
  */
  TIM1_TimeBaseInit(1032, TIM1_COUNTERMODE_UP, 6, 0);
  
  /*
  TIM1_OCMode = TIM1_OCMODE_PWM2
  TIM1_OutputState = TIM1_OUTPUTSTATE_ENABLE
  TIM1_OutputNState = TIM1_OUTPUTNSTATE_ENABLE
  TIM1_Pulse = CCR1_Val
  TIM1_OCPolarity = TIM1_OCPOLARITY_LOW
  TIM1_OCNPolarity = TIM1_OCNPOLARITY_HIGH
  TIM1_OCIdleState = TIM1_OCIDLESTATE_SET
  TIM1_OCNIdleState = TIM1_OCIDLESTATE_RESET
  */
  TIM1_OC3Init(TIM1_OCMODE_PWM1, 
               TIM1_OUTPUTSTATE_ENABLE, 
               TIM1_OUTPUTNSTATE_ENABLE,
               3,    //by³o 3
               TIM1_OCPOLARITY_LOW, 
               TIM1_OCNPOLARITY_HIGH, 
               TIM1_OCIDLESTATE_SET,
               TIM1_OCNIDLESTATE_RESET); 
  
  //TIM1_CCPreloadControl(ENABLE);
  TIM1_ITConfig(TIM1_IT_COM, DISABLE);

  /* TIM1 counter enable */
  TIM1_Cmd(ENABLE);
  
  /* TIM1 Main Output Enable */
  TIM1_CtrlPWMOutputs(ENABLE);
}

void Timer1_1200Hz(){
  uint16_t TIM1_Prescaler = 1896;
  /* Set the Prescaler value */
  TIM1->PSCRH = (uint8_t)(TIM1_Prescaler >> 8);
  TIM1->PSCRL = (uint8_t)(TIM1_Prescaler);
}

void Timer1_2200Hz(){
  uint16_t TIM1_Prescaler = 1044;
  /* Set the Prescaler value */
  TIM1->PSCRH = (uint8_t)(TIM1_Prescaler >> 8);
  TIM1->PSCRL = (uint8_t)(TIM1_Prescaler);
}

void Timer2_Init(){
  TIM2_DeInit();
  TIM2_TimeBaseInit(TIM2_PRESCALER_2, 6630);    //1200 = X/(2*6630) Fclk = 15.912.000 ~fcpu
  
  TIM2_ITConfig(TIM2_IT_UPDATE, ENABLE);

  /* TIM1 counter enable */
  TIM2_Cmd(ENABLE);
}

void Timer2_ISR(){
  //GPIOC->ODR ^= 0x08;   //Push-Pull
  //GPIO_WriteReverse(GPIOC, GPIO_PIN_3);
  /* byte to send (LSB first) */
  static unsigned char bits = 0;

  /* number of bits in 'bits' sent */
  static unsigned char bit_count = 0;

  /* count the 1's sent -- used for AX.25 but stuffing */
  static unsigned char ones_count = 0;

  /* Does 'bits' contain the AX.25 Flag? Used to avoid bit stuffing in that case. */
  static unsigned char sending_ax25_flag;

  /* index in the tones array */
  static unsigned char tones_index = 0;

  /* Is the buffer 'bits' empty? If so, get more bits */
  if (bit_count == 0) {

          /* Do we have any bytes that need to be sent? */
          if (APRS_frame.point >= APRS_frame.size) {
                  APRS_frame.end = 1;
                  /* The buffer is empty. We can stop sending now.
                   * The loop in main() will detect an empty buffer
                   * and disable this interrupt for us.
                   */
                  return;
          }

          bits = APRS_frame.data[APRS_frame.point++];
          bit_count = 8;
          sending_ax25_flag = (bits == AX25_FLAG);
  }

  if (!(bits & 0x01)) { /* is current bit 0? */

          /* if the current bit is a 0, then toggle */
          tones_index = !tones_index;
          if(tones_index == 0) Timer1_1200Hz();
          else Timer1_2200Hz();
          ones_count = 0;

          bits >>= 1;
          bit_count--;

  } else if (ones_count++ >= 5 && !sending_ax25_flag) {

          /* bit stuff */
          tones_index = !tones_index;
          if(tones_index == 0) Timer1_1200Hz();
          else Timer1_2200Hz();
          ones_count = 0;

  } else { /* current bit is 1 (don't toggle) */

          bits >>= 1;
          bit_count--;
  }
}
/*
char tx_buffer_dequeue(void) {

	char c;

	if (tx_buffer_empty()) {
		c = AX25_FLAG;
	} else {
		c = tx_buffer[tx_buffer_head++];
	}
	return c;
}

void tx_buffer_queue(char c) {

	// since tx_buffer_tail is an unsigned char, it will roll over
        // to 0 after it gets to 255, avoiding an overflow of tx_buffer
	//
	tx_buffer[tx_buffer_tail++] = c;
}

char tx_buffer_empty(void) {

	return (tx_buffer_head == tx_buffer_tail);
}
*/


#ifdef USE_FULL_ASSERT

/**
  * @brief  Reports the name of the source file and the source line number
  *   where the assert_param error has occurred.
  * @param file: pointer to the source file name
  * @param line: assert_param error line source number
  * @retval : None
  */
void assert_failed(u8* file, u32 line)
{ 
  /* User can add his own implementation to report the file name and line number,
     ex: printf("Wrong parameters value: file %s on line %d\r\n", file, line) */

  /* Infinite loop */
  while (1)
  {
  }
}
#endif


/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
